[
  {
    "id": 1,
    "name": "4K Monitor",
    "description": "A stunning 4K Ultra HD display with vibrant colors and ultra-sharp clarity. Perfect for graphic designers, video editors, gamers, and anyone who needs a premium viewing experience.",
    "price": 400,
    "image": "https://i.ibb.co/0prGsLdx/view-computer-monitor-display-23-2150757537.avif"
  },
  {
    "id": 2,
    "name": "Gaming Chair",
    "description": "Ergonomic gaming chair with adjustable height, reclining backrest, lumbar cushion, breathable fabric, and premium comfort for long gaming or office sessions.",
    "price": 180,
    "image": "https://i.ibb.co/WvPCTdWx/pngtree-the-yellow-and-black-gaming-chair-is-on-display-image-2608606.jpg"
  },
  {
    "id": 3,
    "name": "RGB Keyboard",
    "description": "Mechanical keyboard with smooth switches, customizable RGB lighting, durable build, and responsive typing experience for gamers, programmers, and office users.",
    "price": 45,
    "image": "https://i.ibb.co/DHhGf6MV/360-F-227265384-A4q2-J0o4ocjsoi2r-E6-DDYWs-PQf-K1p-J7p.jpg"
  },
  {
    "id": 4,
    "name": "USB Microphone",
    "description": "A studio-quality USB microphone designed for podcasts, streaming, voice recording, and video calls. It features noise reduction, clear voice capture, and a modern stand design.",
    "price": 90,
    "image": "https://i.ibb.co/20S9sk35/MAONO-PD100-U-Dynamic-USB-Microphone-1000x1000-jpg-550x550.jpg"
  },
  {
    "id": 5,
    "name": "DSLR Camera",
    "description": "A professional-grade DSLR camera offering crystal-clear photos, high-speed autofocus, 4K video recording, and excellent performance for creators and photographers.",
    "price": 700,
    "image": "https://i.ibb.co/bgR1yMgW/camera-431119-1280.jpg"
  },
  {
    "id": 6,
    "name": "Power Bank",
    "description": "A high-capacity portable power bank that supports fast charging and multiple device output. Perfect for travel, emergencies, and daily use to keep your phone, tablet, and gadgets fully charged on the go.",
    "price": 35,
    "image": "https://i.ibb.co/ZzYhg2JM/360-F-1599346011-c-Rhg5lys-ZLNqh-PUO0i5-R1i-Ga-MMptc-HPz.jpg"
  },
  {
    "id": 7,
    "name": "Smart Laptop",
    "description": "A lightweight and ultra-fast laptop designed for students, freelancers, and professionals. It features a powerful processor, long battery life, crisp display, and fast SSD storage for smooth multitasking and high-performance productivity.",
    "price": 850,
    "image": "https://i.ibb.co/5XB9Kfgb/images-3.jpg"
  },
  {
    "id": 8,
    "name": "Wi-Fi Router",
    "description": "Fast dual-band router providing stable internet, wide coverage, multiple device connectivity, and strong security for smart homes, offices, and gaming setups.",
    "price": 65,
    "image": "https://i.ibb.co/FkKSLDGS/pngtree-d-render-of-white-background-with-modern-wifi-router-featuring-glowing-image-3903394.jpg"
  },
  {
    "id": 9,
    "name": "Smart Watch",
    "description": "A stylish smartwatch with fitness tracking, heart-rate monitoring, sleep analysis, water resistance, Bluetooth notifications, and long-lasting battery life for daily health monitoring.",
    "price": 70,
    "image": "https://i.ibb.co/sJMvhKXB/istockphoto-486993228-612x612.jpg"
  },
  {
    "id": 10,
    "name": "SSD Drive",
    "description": "High-speed portable SSD with ultra-fast data transfer, shockproof casing, compact design, and excellent reliability for backups, editing, and large file handling.",
    "price": 115,
    "image": "https://i.ibb.co/Xfv29fGg/images-4.jpg"
  },
  {
    "id": 11,
    "name": "Bluetooth Speaker",
    "description": "Portable speaker with 360° surround sound, waterproof design, deep bass performance, and long battery backup. Perfect for parties, travel, and outdoor adventure.",
    "price": 55,
    "image": "https://i.ibb.co/wrQKJNL8/images-1.jpg"
  },
  {
    "id": 12,
    "name": "Wireless Headset",
    "description": "High-quality wireless headphones with deep bass, noise cancellation, and ultra-soft ear cushions. Ideal for music, meetings, gaming, and long listening sessions without discomfort.",
    "price": 120,
    "image": "https://i.ibb.co/mV4zG23V/images-2.jpg"
  }
]